In [21]:
from sqlalchemy import create_engine, MetaData, Table, select

db = create_engine('postgres://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb')
print(db.table_names())
metadata = MetaData()
table = Table('staff', metadata , autoload=True, autoload_with=db)
print(table.columns.keys())

['staff', 'category', 'film_category', 'country', 'actor', 'language', 'store', 'rental', 'city', 'address', 'film_actor', 'payment', 'users', 'film', 'customer', 'inventory']
['staff_id', 'first_name', 'last_name', 'address_id', 'email', 'store_id', 'active', 'username', 'password', 'last_update', 'picture']

In [22]:
metadata = MetaData()
table = Table('category', metadata , autoload=True, autoload_with=db)
stmt = select([table])

res = db.execute(stmt).fetchall()
len(res)

16

In [23]:
import pandas as pd
res = db.execute(stmt).fetchmany(2)
pd.DataFrame(res)

   0          1                   2
0  1     Action 2006-02-15 09:46:27
1  2  Animation 2006-02-15 09:46:27

In [37]:
from sqlalchemy import desc, asc

metadata = MetaData()
table = Table('film', metadata , autoload=True, autoload_with=db)
stmt = select([table])
stmt = stmt.order_by(desc(table.columns.release_year))

res = db.execute(stmt).fetchmany(1)

pd.DataFrame(res)

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...

In [38]:
metadata = MetaData()
table = Table('film', metadata , autoload=True, autoload_with=db)
stmt = select([table])
stmt = stmt.order_by(asc(table.columns.release_year))

res = db.execute(stmt).fetchmany(1)

pd.DataFrame(res)

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...

In [57]:
from sqlalchemy import or_

metadata = MetaData()
table = Table('actor', metadata , autoload=True, autoload_with=db)
stmt = select([table])
stmt = stmt.where((table.columns.first_name == "Olympia") | (table.columns.first_name == "Julia") | (table.columns.first_name == "Ellen"))

res = db.execute(stmt).fetchall()

pd.DataFrame(res)

     0        1          2                       3
0   27    Julia    Mcqueen 2013-05-26 14:47:57.620
1   47    Julia  Barrymore 2013-05-26 14:47:57.620
2   93    Ellen    Presley 2013-05-26 14:47:57.620
3  171  Olympia   Pfeiffer 2013-05-26 14:47:57.620
4  186    Julia  Zellweger 2013-05-26 14:47:57.620
5  199    Julia    Fawcett 2013-05-26 14:47:57.620